# RelinquishedItems Class

---
List of elements and worksets that were relinquished by the current user.
SystemObject Autodesk.Revit.DBRelinquishedItems
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RelinquishedItems : IDisposable

    Public Class RelinquishedItems
    	Implements IDisposable

    public ref class RelinquishedItems : IDisposable

    type RelinquishedItems =
        class
            interface IDisposable
        end
The RelinquishedItems type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the RelinquishedItems
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetRelinquishedElements|  The elements that were relinquished by the current user.
| GetRelinquishedWorksets|  The elements that were relinquished by the current user.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace